
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/ruzickap/my-git-projects/actions/runs/14990920507)



<pre><code>Apply complete! Resources: 0 added, 17 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.http.my_file: Reading...
cloudflare_zero_trust_access_tag.tags["container"]: Refreshing state... [id=container]
cloudflare_zero_trust_access_tag.tags["rpi"]: Refreshing state... [id=rpi]
cloudflare_zero_trust_access_tag.tags["router"]: Refreshing state... [id=router]
cloudflare_zero_trust_access_tag.tags["wifi"]: Refreshing state... [id=wifi]
cloudflare_zone.xvx_cz: Refreshing state... [id=b84174cc7be41b21a9c36d62aff39e84]
cloudflare_zero_trust_access_tag.tags["wan"]: Refreshing state... [id=wan]
cloudflare_zone.mylabs_dev: Refreshing state... [id=2859c4d6f599a36a424765646b79904e]
cloudflare_zero_trust_access_tag.tags["iot"]: Refreshing state... [id=iot]
cloudflare_zero_trust_access_tag.tags["lan"]: Refreshing state... [id=lan]
cloudflare_zone.ruzicka_dev: Refreshing state... [id=452e45a673326608122e759793a713f3]
cloudflare_zero_trust_access_identity_provider.google_oauth: Refreshing state... [id=984fa76c-21de-405c-9646-c955147273a4]
cloudflare_zero_trust_access_policy.allow_all: Refreshing state... [id=f2ea6f70-de33-4e8a-8f0e-3e6db37c6a69]
cloudflare_zero_trust_access_policy.google_sso_access: Refreshing state... [id=2ed4bba2-34a8-43bb-afbb-efa82e9bd96b]
cloudflare_dns_record.cname_xvx_cz: Refreshing state... [id=129f72a534e70fdde7f7b0d0d8de09f8]
cloudflare_dns_record.cname_www_ruzickovabozena_xvx_cz: Refreshing state... [id=74c6f605b8e3bdadda60e83b1072da46]
cloudflare_dns_record.txt_google_site_verification_xvx_cz: Refreshing state... [id=d3dec2add7b745e8ad95b9dde7ec4692]
cloudflare_dns_record.cname_www_linux_old_xvx_cz: Refreshing state... [id=4a810c020747f52c0e5638fb16034770]
cloudflare_dns_record.mx2_xvx_cz: Refreshing state... [id=f0b0eafd0d4dbe89a2e5130ed376afcf]
cloudflare_dns_record.cname_cestovani_xvx_cz: Refreshing state... [id=13762e91a934735c093cd338d3f9b577]
cloudflare_dns_record.cname_svatba_xvx_cz: Refreshing state... [id=6deb708f40e8cdc44af9f26214041d50]
cloudflare_dns_record.cname_ruzickovabozena_xvx_cz: Refreshing state... [id=2dd46a0ff555377bb1ca39e2294e2734]
cloudflare_dns_record.mx5_xvx_cz: Refreshing state... [id=5aa6aab8b2b89bebf1907dc080e058b5]
cloudflare_dns_record.txt_spf1_xvx_cz: Refreshing state... [id=06890237b2511496df6878acb9824f33]
cloudflare_dns_record.a_gate_bracha_xvx_cz: Refreshing state... [id=9be04858272f22620ad1b27cd7b5f76e]
cloudflare_dns_record.txt_acme_challenge_auth_infra_xvx_cz: Refreshing state... [id=266ba9c4df2471841c54dc3cec8821a5]
cloudflare_dns_record.mx4_xvx_cz: Refreshing state... [id=1f909e273d7f77cb8d2ade9c2b33f5a8]
cloudflare_dns_record.txt_dkim1_google_domainkey_xvx_cz: Refreshing state... [id=7a6aca074c2c843300481dd24b367db9]
cloudflare_dns_record.mx3_xvx_cz: Refreshing state... [id=3b89d2aec9feac9aaf4f591f6dc38587]
cloudflare_dns_record.cname_www_svatba_xvx_cz: Refreshing state... [id=1c9fcf3f9970c7205ac0866edfd967f3]
cloudflare_dns_record.cname_byt_xvx_cz: Refreshing state... [id=4ec0db0c0a3324765b5d8909e6edba5f]
data.http.my_file: Read complete after 0s [id=https://uptimerobot.com/inc/files/ips/IPv4andIPv6.txt]
cloudflare_dns_record.cname_linux_old_xvx_cz: Refreshing state... [id=15fb100a9e230402aa1c86f3d58efe9e]
cloudflare_dns_record.cname_www_xvx_cz: Refreshing state... [id=c7fb0d86b11373cd9cde58aa1ae5a789]
cloudflare_dns_record.cname_linux_xvx_cz: Refreshing state... [id=5df4b6886b43d1d615360f3bab861527]
cloudflare_dns_record.a_raspi_xvx_cz: Refreshing state... [id=42b1926b3be431f1d598085c32193eca]
cloudflare_dns_record.cname_www_linux_xvx_cz: Refreshing state... [id=7a420cfcd4e1d79d95988c348ee138f7]
cloudflare_dns_record.cname_petr_xvx_cz: Refreshing state... [id=7d211321aa14c8b2bb46b5884370bb0d]
cloudflare_dns_record.txt_dmarc1_dmarc_xvx_cz: Refreshing state... [id=2ec53d109d14c8bb15fb8dcaced94292]
cloudflare_dns_record.mx1_xvx_cz: Refreshing state... [id=088cef876698a0ddcbca2026a21bfd95]
cloudflare_dns_record.a_stats_xvx_cz: Refreshing state... [id=b90204c8ccf0315cbf61a258dc06c2e3]
cloudflare_dns_record.cname_www_mylabs_dev: Refreshing state... [id=d3feaa152c14f6f38c69d384ba4f5111]
cloudflare_dns_record.ns4_aws_mylabs_dev: Refreshing state... [id=9bdfd9d4ad07b2946910408a7abbf540]
cloudflare_dns_record.ns1_k8s_mylabs_dev: Refreshing state... [id=bb4675cb0c3a2fcb29cec8d26a466d54]
cloudflare_dns_record.mx2_mylabs_dev: Refreshing state... [id=3224096c7ca0547917f9c0026aa65f88]
cloudflare_dns_record.ns2_k8s_mylabs_dev: Refreshing state... [id=735395882005c878dfcfdaa0fc3c0b4a]
cloudflare_dns_record.txt_cf2024_1_domainkey_mylabs_dev: Refreshing state... [id=8820748f17e5b98fb90dd2caf4b51711]
cloudflare_dns_record.mx3_mylabs_dev: Refreshing state... [id=54c0a1c1eca296a1e1449ef5300fe3d2]
cloudflare_dns_record.ns3_k8s_mylabs_dev: Refreshing state... [id=8409985e399eb9ff87bb26e9663b8903]
cloudflare_dns_record.ns4_k8s_mylabs_dev: Refreshing state... [id=edeb28878e93de06491a321036737864]
cloudflare_dns_record.ns2_aws_mylabs_dev: Refreshing state... [id=c09981c61ebf3756ff5f717ced460d7c]
cloudflare_dns_record.cname_mylabs_dev: Refreshing state... [id=512175704937e92cfc53a4711bcfba1a]
cloudflare_dns_record.mx1_mylabs_dev: Refreshing state... [id=83cf9c058c96fce13afbf648b00891a5]
cloudflare_dns_record.ns3_aws_mylabs_dev: Refreshing state... [id=d207b2188295decc79b025a03bbd5928]
cloudflare_dns_record.spf_txt_mylabs_dev: Refreshing state... [id=12b0353211ea68f2e01d41c96582087a]
cloudflare_dns_record.ns1_aws_mylabs_dev: Refreshing state... [id=fdb99a821d84d9685861804054b04cf9]
cloudflare_dns_record.cname_www_ruzicka_dev: Refreshing state... [id=54daa51645ec0c8268be734d23ff39ea]
cloudflare_dns_record.cname_blog_ruzicka_dev: Refreshing state... [id=40b2f2c58767f934a85dd09857036003]
cloudflare_dns_record.mx3_ruzicka_dev: Refreshing state... [id=dc2ccc3ddf800440e8cb36b2750628ff]
cloudflare_dns_record.txt_github_pages_challenge_ruzickap_ruzicka_dev: Refreshing state... [id=3278fdec9a5bee7946a9d4cd65dc7645]
cloudflare_dns_record.cname_ruzicka_dev: Refreshing state... [id=6012deab4c329d17d2c64685ab381aa1]
cloudflare_dns_record.cname_stats_ruzickap_github_io_ruzicka_dev: Refreshing state... [id=4e6ec427d1f22a61d21b3e6e401d9475]
cloudflare_dns_record.cname_petr_ruzicka_dev: Refreshing state... [id=560582f3686f60730649302acc4a54f6]
cloudflare_dns_record.spf_txt_ruzicka_dev: Refreshing state... [id=37c6dd1d4f442313753b992ef048ab84]
cloudflare_dns_record.mx1_ruzicka_dev: Refreshing state... [id=72c3096bb3dfbbea638b11ec6a9084f1]
cloudflare_dns_record.txt_cf2024_1_domainkey_ruzicka_dev: Refreshing state... [id=a21bd05ef17e1277f9f0ec1756b8f320]
cloudflare_dns_record.mx2_ruzicka_dev: Refreshing state... [id=998e7ce6783759477c42e79b700f2a2b]
cloudflare_zero_trust_list.uptimerobot_ips: Refreshing state... [id=b5b64409-9bb0-4e2a-9564-0268c7c2795d]
cloudflare_zero_trust_tunnel_cloudflared.tunnels["raspi"]: Refreshing state... [id=2977bd0a-fb18-457b-8dce-5decaa86c002]
cloudflare_zero_trust_tunnel_cloudflared.tunnels["gate"]: Refreshing state... [id=a4f1acfd-e2dd-4076-a618-fe631b991542]
cloudflare_zero_trust_tunnel_cloudflared_config.configs["gate"]: Refreshing state... [id=a4f1acfd-e2dd-4076-a618-fe631b991542]
cloudflare_zero_trust_tunnel_cloudflared_config.configs["raspi"]: Refreshing state... [id=2977bd0a-fb18-457b-8dce-5decaa86c002]
cloudflare_dns_record.cname_zero_trust_tunnel["zigbee2mqtt-rpi.xvx.cz"]: Refreshing state... [id=9a1445fb004039537828abeb1e641131]
cloudflare_dns_record.cname_zero_trust_tunnel["grafana-rpi.xvx.cz"]: Refreshing state... [id=4d48ce3991d5e292882f46a2aea80fa2]
cloudflare_dns_record.cname_zero_trust_tunnel["gate.xvx.cz"]: Refreshing state... [id=518461891bf2491bdc5f935b7164ed7f]
cloudflare_dns_record.cname_zero_trust_tunnel["rpi-ssh.xvx.cz"]: Refreshing state... [id=5004e48e14e173be5f2f9323f259b4c3]
cloudflare_dns_record.cname_zero_trust_tunnel["msr-2.xvx.cz"]: Refreshing state... [id=19db42c9d6626e6df2422d7eb025b932]
cloudflare_dns_record.cname_zero_trust_tunnel["kodi-rpi.xvx.cz"]: Refreshing state... [id=ba3bd52597a6eec8c1801c07ea42dba7]
cloudflare_dns_record.cname_zero_trust_tunnel["rpi.xvx.cz"]: Refreshing state... [id=5396c76d91d1e6444b88af88b4711686]
cloudflare_dns_record.cname_zero_trust_tunnel["gate-ssh.xvx.cz"]: Refreshing state... [id=7a639c1578acfd9e2cbffed45b40233b]
cloudflare_dns_record.cname_zero_trust_tunnel["alloy-rpi.xvx.cz"]: Refreshing state... [id=b34a8fcc59c844513b2a5c95f653d5c8]
cloudflare_dns_record.cname_zero_trust_tunnel["prometheus-rpi.xvx.cz"]: Refreshing state... [id=8b991263ad7bbd09af68995b9de0471e]
cloudflare_dns_record.cname_zero_trust_tunnel["uzg-01.xvx.cz"]: Refreshing state... [id=67121917f6c4711bd210c97b6e3008e3]
cloudflare_dns_record.cname_zero_trust_tunnel["cadvisor-rpi.xvx.cz"]: Refreshing state... [id=2fb935bec830ed5749a6201ea0527a42]
cloudflare_dns_record.cname_zero_trust_tunnel["transmission.xvx.cz"]: Refreshing state... [id=13c36466f66b6d99597819a3dc323429]
cloudflare_dns_record.cname_zero_trust_tunnel["esphome-rpi.xvx.cz"]: Refreshing state... [id=dd86c29cf9708a412be85efa6c5ec5bb]
cloudflare_dns_record.cname_zero_trust_tunnel["hass-rpi.xvx.cz"]: Refreshing state... [id=e44d9f89910ebb8d369a064d6f8a06e7]
cloudflare_zero_trust_access_policy.uptimerobot_direct_access: Refreshing state... [id=ca1b7a48-77b5-4e14-a1de-8decc316ae27]
cloudflare_zero_trust_access_application.applications["gate"]: Refreshing state... [id=384c5b04-09c0-4bf4-ba0b-0bab877c77c6]
cloudflare_zero_trust_access_application.applications["transmission"]: Refreshing state... [id=078d4df8-d904-4d92-b5bf-e8e5b08cd8bd]
cloudflare_zero_trust_access_application.applications["uzg-01"]: Refreshing state... [id=35d40417-6d31-4832-b047-582e49f7c2c2]
cloudflare_zero_trust_access_application.applications["esphome-rpi"]: Refreshing state... [id=fa2dbbc1-f275-44d6-99d4-67a78242cd09]
cloudflare_zero_trust_access_application.applications["grafana-rpi"]: Refreshing state... [id=59ea1b37-74c5-4704-ab7a-448aa6301790]
cloudflare_zero_trust_access_application.applications["zigbee2mqtt-rpi"]: Refreshing state... [id=21d3d48b-6360-44f8-bef1-c87051700114]
cloudflare_zero_trust_access_application.applications["prometheus-rpi"]: Refreshing state... [id=dbef68a1-50d1-4e4e-ad8c-1107d466bd1a]
cloudflare_zero_trust_access_application.applications["rpi"]: Refreshing state... [id=a45b048c-e9b0-4080-b34b-9dbb18fca939]
cloudflare_zero_trust_access_application.applications["msr-2"]: Refreshing state... [id=a52a1a8a-3783-419e-a417-e22499760c4b]
cloudflare_zero_trust_access_application.applications["alloy-rpi"]: Refreshing state... [id=ec4db0d2-7033-4148-b870-c4270139e540]
cloudflare_zero_trust_access_application.applications["hass-rpi"]: Refreshing state... [id=b2dfe473-1781-4dc1-aedd-12b8fa085abf]
cloudflare_zero_trust_access_application.applications["cadvisor-rpi"]: Refreshing state... [id=63384a1c-64fa-4829-826e-6b4bcf138487]
cloudflare_zero_trust_access_application.applications["kodi-rpi"]: Refreshing state... [id=938fc2ec-6543-45be-a5fb-d5732333fb73]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

OpenTofu will perform the following actions:

  # cloudflare_zero_trust_access_application.applications["alloy-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "5aa1a2eac9c010765f288628c114c9762f087eee168bd528594071802aa5b94c" -> (known after apply)
      ~ created_at                   = "2025-05-13T06:44:09Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "alloy-rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "ec4db0d2-7033-4148-b870-c4270139e540"
      + landing_page_design          = (known after apply)
        name                         = "alloy-rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "ca1b7a48-77b5-4e14-a1de-8decc316ae27"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "b5b64409-9bb0-4e2a-9564-0268c7c2795d" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2ed4bba2-34a8-43bb-afbb-efa82e9bd96b"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "alloy-rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
        tags                         = [
            "rpi",
            "wifi",
        ]
      ~ updated_at                   = "2025-05-13T07:29:28Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["cadvisor-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "4d7061291e49ca3ac3f0e2f7eca6287075d072e0067a1b65c6dbdbc42f7016ae" -> (known after apply)
      ~ created_at                   = "2025-05-13T06:44:10Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "cadvisor-rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "63384a1c-64fa-4829-826e-6b4bcf138487"
      + landing_page_design          = (known after apply)
        name                         = "cadvisor-rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "ca1b7a48-77b5-4e14-a1de-8decc316ae27"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "b5b64409-9bb0-4e2a-9564-0268c7c2795d" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2ed4bba2-34a8-43bb-afbb-efa82e9bd96b"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "cadvisor-rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
        tags                         = [
            "rpi",
            "wifi",
        ]
      ~ updated_at                   = "2025-05-13T07:29:28Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["esphome-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "8e8ce559197e93fe7997a98fb776a52a3cf807e39d35928597d5497ebf65d1fc" -> (known after apply)
      ~ created_at                   = "2025-05-13T06:44:09Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "esphome-rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "fa2dbbc1-f275-44d6-99d4-67a78242cd09"
      + landing_page_design          = (known after apply)
        name                         = "esphome-rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "ca1b7a48-77b5-4e14-a1de-8decc316ae27"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "b5b64409-9bb0-4e2a-9564-0268c7c2795d" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2ed4bba2-34a8-43bb-afbb-efa82e9bd96b"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "esphome-rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "rpi",
            "container",
            "iot",
          + "rpi",
            "wifi",
        ]
      ~ updated_at                   = "2025-05-13T07:29:28Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["gate"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "20251e8ccf2c9f1b52815d11a83936645d77ddc93147e622b9ba48b91d3862d7" -> (known after apply)
      ~ created_at                   = "2025-05-13T06:44:09Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "gate.xvx.cz" -> null
            },
        ] -> null
        id                           = "384c5b04-09c0-4bf4-ba0b-0bab877c77c6"
      + landing_page_design          = (known after apply)
        name                         = "gate"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "ca1b7a48-77b5-4e14-a1de-8decc316ae27"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "b5b64409-9bb0-4e2a-9564-0268c7c2795d" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2ed4bba2-34a8-43bb-afbb-efa82e9bd96b"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "gate.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          + "lan",
            "router",
            "wan",
          - "lan",
        ]
      ~ updated_at                   = "2025-05-13T07:29:27Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["grafana-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "4f1345d9ed6480a6815190f65f69c37c6c811f6b9a7d07d1cc73a6530595bf76" -> (known after apply)
      ~ created_at                   = "2025-05-13T06:44:09Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "grafana-rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "59ea1b37-74c5-4704-ab7a-448aa6301790"
      + landing_page_design          = (known after apply)
        name                         = "grafana-rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "ca1b7a48-77b5-4e14-a1de-8decc316ae27"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "b5b64409-9bb0-4e2a-9564-0268c7c2795d" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2ed4bba2-34a8-43bb-afbb-efa82e9bd96b"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "grafana-rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
        tags                         = [
            "rpi",
            "wifi",
        ]
      ~ updated_at                   = "2025-05-13T07:29:28Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["hass-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "e8a2833d05c5ddba41c92a8659b95510b37dd06b2b3dfca978b84a2ed4d94a64" -> (known after apply)
      ~ created_at                   = "2025-05-13T06:44:10Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "hass-rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "b2dfe473-1781-4dc1-aedd-12b8fa085abf"
      + landing_page_design          = (known after apply)
        name                         = "hass-rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "f2ea6f70-de33-4e8a-8f0e-3e6db37c6a69"
              - include    = [
                  - {
                      - everyone = {} -> null
                    },
                ] -> null
              - name       = "Allow All" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "hass-rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "rpi",
            "container",
            "iot",
          + "rpi",
            "wifi",
        ]
      ~ updated_at                   = "2025-05-13T07:29:27Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["kodi-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "3b8a30bfd1ffd496a06c803ffdde4250fa00ddc359f310a33f2d0c2f778ffabc" -> (known after apply)
      ~ created_at                   = "2025-05-13T06:44:09Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "kodi-rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "938fc2ec-6543-45be-a5fb-d5732333fb73"
      + landing_page_design          = (known after apply)
        name                         = "kodi-rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "ca1b7a48-77b5-4e14-a1de-8decc316ae27"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "b5b64409-9bb0-4e2a-9564-0268c7c2795d" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] 90m-> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2ed4bba2-34a8-43bb-afbb-efa82e9bd96b"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "kodi-rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
        tags                         = [
            "rpi",
            "wifi",
        ]
      ~ updated_at                   = "2025-05-13T07:29:28Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["msr-2"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "44196a1a2a31f9de7e9606e2fb3b345464d1be5d64323361b3cb3a060b32c361" -> (known after apply)
      ~ created_at                   = "2025-05-13T06:44:09Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "msr-2.xvx.cz" -> null
            },
        ] -> null
        id                           = "a52a1a8a-3783-419e-a417-e22499760c4b"
      + landing_page_design          = (known after apply)
        name                         = "msr-2"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "ca1b7a48-77b5-4e14-a1de-8decc316ae27"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "b5b64409-9bb0-4e2a-9564-0268c7c2795d" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2ed4bba2-34a8-43bb-afbb-efa82e9bd96b"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "msr-2.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
        tags                         = [
            "iot",
            "wifi",
        ]
      ~ updated_at                   = "2025-05-13T07:29:28Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["prometheus-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "ae0279169f54c8a0727e8059f889ee7527503b28a0a8fa052b2a59885d0095f4" -> (known after apply)
      ~ created_at                   = "2025-05-13T06:44:09Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "prometheus-rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "dbef68a1-50d1-4e4e-ad8c-1107d466bd1a"
      + landing_page_design          = (known after apply)
        name                         = "prometheus-rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "ca1b7a48-77b5-4e14-a1de-8decc316ae27"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "b5b64409-9bb0-4e2a-9564-0268c7c2795d" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2ed4bba2-34a8-43bb-afbb-efa82e9bd96b"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "prometheus-rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
        tags                         = [
            "rpi",
            "wifi",
        ]
      ~ updated_at                   = "2025-05-13T07:29:28Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "b7a803fa2d3fc41dd4806e71a091433798fe37deb15f61ec0e72c6dda70af517" -> (known after apply)
      ~ created_at                   = "2025-05-13T06:44:09Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "a45b048c-e9b0-4080-b34b-9dbb18fca939"
      + landing_page_design          = (known after apply)
        name                         = "rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "ca1b7a48-77b5-4e14-a1de-8decc316ae27"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "b5b64409-9bb0-4e2a-9564-0268c7c2795d" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2ed4bba2-34a8-43bb-afbb-efa82e9bd96b"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "rpi",
            "container",
          + "rpi",
            "wifi",
        ]
      ~ updated_at                   = "2025-05-13T07:29:27Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["transmission"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "f52265b960f266ba905e0b81327725ea3ed2ea8b0830189711253b99670555df" -> (known after apply)
      ~ created_at                   = "2025-05-13T06:44:10Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "transmission.xvx.cz" -> null
            },
        ] -> null
        id                           = "078d4df8-d904-4d92-b5bf-e8e5b08cd8bd"
      + landing_page_design          = (known after apply)
        name                         = "transmission"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "ca1b7a48-77b5-4e14-a1de-8decc316ae27"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "b5b64409-9bb0-4e2a-9564-0268c7c2795d" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2ed4bba2-34a8-43bb-afbb-efa82e9bd96b"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "transmission.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
        tags                         = [
            "router",
        ]
      ~ updated_at                   = "2025-05-13T07:29:28Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["uzg-01"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "898bdd3e4da872a97613d91f267c82f8d927f5a98c3a6b120954acaa5b1b0340" -> (known after apply)
      ~ created_at                   = "2025-05-13T06:44:09Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "uzg-01.xvx.cz" -> null
            },
        ] -> null
        id                           = "35d40417-6d31-4832-b047-582e49f7c2c2"
      + landing_page_design          = (known after apply)
        name                         = "uzg-01"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "ca1b7a48-77b5-4e14-a1de-8decc316ae27"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "b5b64409-9bb0-4e2a-9564-0268c7c2795d" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2ed4bba2-34a8-43bb-afbb-efa82e9bd96b"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "uzg-01.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "lan",
            "iot",
          + "lan",
        ]
      ~ updated_at                   = "2025-05-13T07:29:28Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["zigbee2mqtt-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "876abc9b4a5ca5e788473ffaf5c21fabdf8ff1f0b81a3f57e4715324f78c6e5b" -> (known after apply)
      ~ created_at                   = "2025-05-13T06:44:09Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "zigbee2mqtt-rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "21d3d48b-6360-44f8-bef1-c87051700114"
      + landing_page_design          = (known after apply)
        name                         = "zigbee2mqtt-rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "ca1b7a48-77b5-4e14-a1de-8decc316ae27"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "b5b64409-9bb0-4e2a-9564-0268c7c2795d" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2ed4bba2-34a8-43bb-afbb-efa82e9bd96b"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "zigbee2mqtt-rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "rpi",
            "container",
            "iot",
          + "rpi",
            "wifi",
        ]
      ~ updated_at                   = "2025-05-13T07:29:28Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_identity_provider.google_oauth will be updated in-place
  ~ resource "cloudflare_zero_trust_access_identity_provider" "google_oauth" {
      ~ config      = {
          + client_secret = (sensitive value)
          ~ redirect_url  = "https://xvxcz.cloudflareaccess.com/cdn-cgi/access/callback" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
        id          = "984fa76c-21de-405c-9646-c955147273a4"
        name        = "My Test Google IDP"
      ~ scim_config = {
          ~ enabled                  = false -> (known after apply)
          + identity_update_behavior = (known after apply)
          + scim_base_url            = (known after apply)
          ~ seat_deprovision         = false -> (known after apply)
          + secret                   = (sensitive value)
          ~ user_deprovision         = false -> (known after apply)
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_policy.allow_all will be updated in-place
  ~ resource "cloudflare_zero_trust_access_policy" "allow_all" {
      ~ app_count        = 1 -> (known after apply)
      ~ created_at       = "2025-05-13T06:44:07Z" -> (known after apply)
      - exclude          = [] -> null
        id               = "f2ea6f70-de33-4e8a-8f0e-3e6db37c6a69"
        name             = "Allow All"
      - require          = [] -> null
      ~ reusable         = true -> (known after apply)
      ~ updated_at       = "2025-05-13T07:29:26Z" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_policy.google_sso_access will be updated in-place
  ~ resource "cloudflare_zero_trust_access_policy" "google_sso_access" {
      ~ app_count        = 12 -> (known after apply)
      ~ created_at       = "2025-05-13T06:44:07Z" -> (known after apply)
      - exclude          = [] -> null
        id               = "2ed4bba2-34a8-43bb-afbb-efa82e9bd96b"
        name             = "Google SSO Access"
      - require          = [] -> null
      ~ reusable         = true -> (known after apply)
      ~ updated_at       = "2025-05-13T07:29:22Z" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_policy.uptimerobot_direct_access will be updated in-place
  ~ resource "cloudflare_zero_trust_access_policy" "uptimerobot_direct_access" {
      ~ app_count        = 12 -> (known after apply)
      ~ created_at       = "2025-05-13T06:44:08Z" -> (known after apply)
      - exclude          = [] -> null
        id               = "ca1b7a48-77b5-4e14-a1de-8decc316ae27"
        name             = "UptimeRobot Direct Access"
      - require          = [] -> null
      ~ reusable         = true -> (known after apply)
      ~ updated_at       = "2025-05-13T07:29:22Z" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 0 to add, 17 to change, 0 to destroy.
cloudflare_zero_trust_access_identity_provider.google_oauth: Modifying... [id=984fa76c-21de-405c-9646-c955147273a4]
cloudflare_zero_trust_access_policy.uptimerobot_direct_access: Modifying... [id=ca1b7a48-77b5-4e14-a1de-8decc316ae27]
cloudflare_zero_trust_access_policy.google_sso_access: Modifying... [id=2ed4bba2-34a8-43bb-afbb-efa82e9bd96b]
cloudflare_zero_trust_access_policy.allow_all: Modifying... [id=f2ea6f70-de33-4e8a-8f0e-3e6db37c6a69]
cloudflare_zero_trust_access_identity_provider.google_oauth: Modifications complete after 0s [id=984fa76c-21de-405c-9646-c955147273a4]
cloudflare_zero_trust_access_policy.uptimerobot_direct_access: Modifications complete after 0s [id=ca1b7a48-77b5-4e14-a1de-8decc316ae27]
cloudflare_zero_trust_access_policy.google_sso_access: Modifications complete after 0s [id=2ed4bba2-34a8-43bb-afbb-efa82e9bd96b]
cloudflare_zero_trust_access_policy.allow_all: Modifications complete after 0s [id=f2ea6f70-de33-4e8a-8f0e-3e6db37c6a69]
cloudflare_zero_trust_access_application.applications["hass-rpi"]: Modifying... [id=b2dfe473-1781-4dc1-aedd-12b8fa085abf]
cloudflare_zero_trust_access_application.applications["cadvisor-rpi"]: Modifying... [id=63384a1c-64fa-4829-826e-6b4bcf138487]
cloudflare_zero_trust_access_application.applications["prometheus-rpi"]: Modifying... [id=dbef68a1-50d1-4e4e-ad8c-1107d466bd1a]
cloudflare_zero_trust_access_application.applications["gate"]: Modifying... [id=384c5b04-09c0-4bf4-ba0b-0bab877c77c6]
cloudflare_zero_trust_access_application.applications["alloy-rpi"]: Modifying... [id=ec4db0d2-7033-4148-b870-c4270139e540]
cloudflare_zero_trust_access_application.applications["grafana-rpi"]: Modifying... [id=59ea1b37-74c5-4704-ab7a-448aa6301790]
cloudflare_zero_trust_access_application.applications["rpi"]: Modifying... [id=a45b048c-e9b0-4080-b34b-9dbb18fca939]
cloudflare_zero_trust_access_application.applications["zigbee2mqtt-rpi"]: Modifying... [id=21d3d48b-6360-44f8-bef1-c87051700114]
cloudflare_zero_trust_access_application.applications["uzg-01"]: Modifying... [id=35d40417-6d31-4832-b047-582e49f7c2c2]
cloudflare_zero_trust_access_application.applications["esphome-rpi"]: Modifying... [id=fa2dbbc1-f275-44d6-99d4-67a78242cd09]
cloudflare_zero_trust_access_application.applications["hass-rpi"]: Modifications complete after 1s [id=b2dfe473-1781-4dc1-aedd-12b8fa085abf]
cloudflare_zero_trust_access_application.applications["transmission"]: Modifying... [id=078d4df8-d904-4d92-b5bf-e8e5b08cd8bd]
cloudflare_zero_trust_access_application.applications["cadvisor-rpi"]: Modifications complete after 1s [id=63384a1c-64fa-4829-826e-6b4bcf138487]
cloudflare_zero_trust_access_application.applications["grafana-rpi"]: Modifications complete after 1s [id=59ea1b37-74c5-4704-ab7a-448aa6301790]
cloudflare_zero_trust_access_application.applications["kodi-rpi"]: Modifying... [id=938fc2ec-6543-45be-a5fb-d5732333fb73]
cloudflare_zero_trust_access_application.applications["msr-2"]: Modifying... [id=a52a1a8a-3783-419e-a417-e22499760c4b]
cloudflare_zero_trust_access_application.applications["prometheus-rpi"]: Modifications complete after 1s [id=dbef68a1-50d1-4e4e-ad8c-1107d466bd1a]
cloudflare_zero_trust_access_application.applications["alloy-rpi"]: Modifications complete after 1s [id=ec4db0d2-7033-4148-b870-c4270139e540]
cloudflare_zero_trust_access_application.applications["zigbee2mqtt-rpi"]: Modifications complete after 1s [id=21d3d48b-6360-44f8-bef1-c87051700114]
cloudflare_zero_trust_access_application.applications["gate"]: Modifications complete after 1s [id=384c5b04-09c0-4bf4-ba0b-0bab877c77c6]
cloudflare_zero_trust_access_application.applications["rpi"]: Modifications complete after 1s [id=a45b048c-e9b0-4080-b34b-9dbb18fca939]
cloudflare_zero_trust_access_application.applications["esphome-rpi"]: Modifications complete after 1s [id=fa2dbbc1-f275-44d6-99d4-67a78242cd09]
cloudflare_zero_trust_access_application.applications["transmission"]: Modifications complete after 0s [id=078d4df8-d904-4d92-b5bf-e8e5b08cd8bd]
cloudflare_zero_trust_access_application.applications["kodi-rpi"]: Modifications complete after 0s [id=938fc2ec-6543-45be-a5fb-d5732333fb73]
cloudflare_zero_trust_access_application.applications["msr-2"]: Modifications complete after 0s [id=a52a1a8a-3783-419e-a417-e22499760c4b]
cloudflare_zero_trust_access_application.applications["uzg-01"]: Modifications complete after 5s [id=35d40417-6d31-4832-b047-582e49f7c2c2]

Apply complete! Resources: 0 added, 17 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"tofu-cloudflare","PRNumber":196,"Program":"tfcmt","SHA1":"7c370c4724d87beae4954dc8e076a546ad5c6711","Vars":{},"WorkflowName":"tofu-cloudflare"} -->